In [22]:
import datetime as dt
import os
import pandas as pd

In [29]:
station_start = 6184
station_end = 6015

In [37]:
def read_csv(year):
    t0 = dt.datetime(year,9,4)
    t1 = t0 + dt.timedelta(days=7, seconds=-1)
    file = os.path.join('data', 'BixiMontrealRentals' + str(year), 'OD_' + str(year) + '-09.csv')
    df = pd.read_csv(file, infer_datetime_format=T)
    return df

In [35]:
df = read_csv(2014)

In [36]:
df.head()

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member
0,2014-09-01 00:00,6036,2014-09-01 00:18,6026,1097,1
1,2014-09-01 00:00,6114,2014-09-01 00:26,6398,1575,1
2,2014-09-01 00:00,6131,2014-09-01 00:11,6178,646,1
3,2014-09-01 00:00,6310,2014-09-01 00:12,6136,715,1
4,2014-09-01 00:00,6131,2014-09-01 00:11,6178,611,1